# `DSML_WS_03` - Introduction to Pandas

In this tutorial we will continue with our introduction series to key python data science libraries. Today we will focus on `Pandas`.

We will go through the following:

- **Introduction to `Pandas` objects**: Learn what `Pandas` Series, DataFrames and Indices are and what they are used for
- **Data selection in `Pandas`**: Idex rows, columns and individual items in a `Pandas` Series and DataFrame
- **Data anaylsis and manipulation in `Pandas`**: Perform advanced hierarchical indexing on your dataset, run simple descriptives on your dataset, basic handling of missing data, carry out aggregation and grouping


## `Pandas`

Pandas is a newer package built on top of `NumPy`, and provides an efficient implementation of a `DataFrame`, the core Pandas object. DataFrames are essentially multidimensional arrays with attached row and column labels, and often with heterogeneous types and/or missing data. As well as offering a convenient storage interface for labeled data, Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs. We will use `Pandas` as the main tool to structure, manipulate and store data throughout this course. As such Pandas constitutes a core data science library that all of you should be very well familiar with.

Let's get started...

In [1]:
import pandas as pd

### Introduction to `Pandas` objects
At the very basic level, Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices. Pandas provides a host of useful tools, methods, and functionality on top of the basic data structures, but nearly everything that follows will require an understanding of what these structures are. Thus, before we go any further, let's introduce these three fundamental Pandas data structures: the Series, DataFrame, and Index.

#### The `Pandas Series` Object
A Pandas Series is a one-dimensional array of indexed data. It can be created from a list or array as follows:

In [2]:
F = pd.Series([12,13,14,15,16,17])
F

0    12
1    13
2    14
3    15
4    16
5    17
dtype: int64

In [3]:
type(F)

pandas.core.series.Series

As we see in the output, the Series wraps both a sequence of values and a sequence of indices, which we can access with the values and index attributes. The values are simply a familiar NumPy array:

In [4]:
F.values

array([12, 13, 14, 15, 16, 17])

The index is an array-like object of type pd.Index, which we'll discuss in more detail later.

In [5]:
F.index

RangeIndex(start=0, stop=6, step=1)

Like with a `NumPy` array, data can be accessed by the associated index via the familiar Python square-bracket notation:

In [6]:
F[0]

12

In [7]:
print(F[2:])

2    14
3    15
4    16
5    17
dtype: int64

From what we've seen so far, it may look like the Series object is basically interchangeable with a one-dimensional NumPy array. **The essential difference is the presence of the index**: while the Numpy Array has an implicitly defined integer index used to access the values, the Pandas Series has an explicitly defined index associated with the values.
This explicit index definition gives the Series object additional capabilities. For example, the index need not be an integer, but can consist of values of any desired type. For example, if we wish, we can use strings as an index:

In [8]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
data['a']

0.25

In this way, you can think of a Pandas Series a bit like a specialization of a Python dictionary. A dictionary is a structure that maps arbitrary keys to a set of arbitrary values, and a Series is a structure which maps typed keys to a set of typed values. This typing is important: just as the type-specific compiled code behind a NumPy array makes it more efficient than a Python list for certain operations, the type information of a Pandas Series makes it much more efficient than Python dictionaries for certain operations.
The Series-as-dictionary analogy can be made even more clear by constructing a Series object directly from a Python dictionary:

In [10]:
population_dict = {'California': 38332521,
                   'Texas': 2644819,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population = pd.Series(population_dict)
population

California    38332521
Texas          2644819
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

Unlike a dictionary, though, the Series also supports array-style operations such as slicing:

In [11]:
population_dict["California"]

38332521

In [12]:
population["California"]

38332521

In [13]:
population['California':'Texas']

California    38332521
Texas          2644819
dtype: int64

In [14]:
population.keys

<bound method Series.keys of California    38332521
Texas          2644819
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64>

#### The `Pandas DataFrame` Object
The next fundamental structure in `Pandas`  is the `DataFrame` . Like the Series object discussed in the previous section, the DataFrame can be thought of either as a generalization of a NumPy array, or as a specialization of a Python dictionary. We'll now take a look at each of these perspectives.

If a Series is an analog of a one-dimensional array with flexible indices, a DataFrame is an analog of a two-dimensional array with both flexible row indices and flexible column names. Just as you might think of a two-dimensional array as an ordered sequence of aligned one-dimensional columns, you can think of a DataFrame as a sequence of aligned Series objects. Here, by "aligned" we mean that they share the same index.

In [15]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64


Now that we have this along with the population Series from before, we can use a dictionary to construct a single two-dimensional object containing this information:

In [16]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas          2644819  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [17]:
type(states)

pandas.core.frame.DataFrame

In [18]:
states.values

array([[38332521,   423967],
       [ 2644819,   695662],
       [19651127,   141297],
       [19552860,   170312],
       [12882135,   149995]])

Like the Series object, the DataFrame has an index attribute that gives access to the index labels:

In [19]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

Additionally, the DataFrame has a columns attribute, which is an Index object holding the column labels:

In [20]:
states.columns

Index(['population', 'area'], dtype='object')


Thus the DataFrame can be thought of as a generalization of a two-dimensional NumPy array, where both the rows and columns have a generalized index for accessing the data.

### The `Pandas Index` Object
We have seen here that both the Series and DataFrame objects contain an explicit index that lets you reference and modify data. This Index object is an interesting structure in itself, and it can be thought of either as an immutable array or as an ordered set (technically a multi-set, as Index objects may contain repeated values). Those views have some interesting consequences in the operations available on Index objects. As a simple example, let's construct an Index from a list of integers:

In [21]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

The Index in many ways operates like an array. For example, we can use standard Python indexing notation to retrieve values or slices:

In [22]:
ind[3]

7

In [23]:
ind[::2] # every second object starting at 0

Int64Index([2, 5, 11], dtype='int64')

Index objects also have many of the attributes familiar from NumPy arrays:

In [24]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

One difference between Index objects and NumPy arrays is that indices are immutable–that is, they cannot be modified via the normal means

In [25]:
ind[1] = 0

TypeError: Index does not support mutable operations

### Data selection in `Pandas`

#### Data Selection in Series

As we saw in the previous section, a Series object acts in many ways like a one-dimensional NumPy array, and in many ways like a standard Python dictionary. If we keep these two overlapping analogies in mind, it will help us to understand the patterns of data indexing and selection in these arrays.

Like a dictionary, the Series object provides a mapping from a collection of keys (i.e. the index) to a collection of values:

In [26]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [27]:
data['b']

0.5

We can also use dictionary-like Python expressions and methods to examine the keys/indices and values:

In [28]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [29]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [30]:
'a' in data

True

Series objects can even be modified with a dictionary-like syntax. Just as you can extend a dictionary by assigning to a new key, you can extend a Series by assigning to a new index value:

In [31]:
data['n'] = 0
data

a    0.25
b    0.50
c    0.75
d    1.00
n    0.00
dtype: float64

In [32]:
data['a'] = 0

In [33]:
data

a    0.00
b    0.50
c    0.75
d    1.00
n    0.00
dtype: float64

A Series builds on this dictionary-like interface and provides array-style item selection via the same basic mechanisms as NumPy arrays – that is, slices, masking, and fancy indexing. Examples of these are as follows:

In [34]:
# slicing by explicit index
data['a':'c']

a    0.00
b    0.50
c    0.75
dtype: float64

In [35]:
# slicing by implicit integer index
data[0:3]

a    0.00
b    0.50
c    0.75
dtype: float64

In [36]:
# masking
data[(data == 0)]

a    0.0
n    0.0
dtype: float64

In [38]:
# multiple indexing
data[['a', 'd', "c","n"]]

a    0.00
d    1.00
c    0.75
n    0.00
dtype: float64

Among these, slicing may be the source of the most confusion. Notice that when slicing with an explicit index (i.e., data['a':'c']), the final index is included in the slice, while when slicing with an implicit index (i.e., data[0:2]), the final index is excluded from the slice.

**Indexers: loc and iloc**

These slicing and indexing conventions can be a source of confusion. For example, if your Series has an explicit integer index, an indexing operation such as data[1] will use the explicit indices, while a slicing operation like data[1:3] will use the implicit Python-style index.

In [39]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [40]:
# explicit index when indexing
data[5]

'c'

In [41]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

Because of this potential confusion in the case of integer indexes, Pandas provides some special indexer attributes that explicitly expose certain indexing schemes. These are not functional methods, but attributes that expose a particular slicing interface to the data in the Series.
First, the `.loc` attribute allows indexing and slicing that always references the **explicit index**:

In [42]:
data.loc[5]

'c'

In [43]:
data.iloc[2]

'c'

In [44]:
data.loc[1:3]

1    a
3    b
dtype: object

The `.iloc` attribute allows indexing and slicing that always references the **implicit Python-style index**:

In [45]:
data.iloc[1]

'b'

In [46]:
data.iloc[1:3]

3    b
5    c
dtype: object

One guiding principle of Python code is that **"explicit is better than implicit"**. The explicit nature of `.loc` and `.iloc` make them very useful in maintaining clean and readable code; especially in the case of integer indexes, I recommend using these both to make code easier to read and understand, and to prevent subtle bugs due to the mixed indexing/slicing convention.

#### Data Selection in DataFrame

Recall that a DataFrame acts in many ways like a two-dimensional or structured array, and in other ways like a dictionary of Series structures sharing the same index. These analogies can be helpful to keep in mind as we explore data selection within this structure.

In [47]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

The individual Series that make up the columns of the DataFrame can be accessed via dictionary-style indexing of the column name:

In [48]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Like with the Series objects discussed earlier, this dictionary-style syntax can also be used to modify the object, in this case adding a new column:

In [49]:
data.values

array([[  423967, 38332521],
       [  695662, 26448193],
       [  141297, 19651127],
       [  170312, 19552860],
       [  149995, 12882135]])

In [50]:
data['area'].values

array([423967, 695662, 141297, 170312, 149995])

In [51]:
data['pop_density'] = data['pop'] / data['area']
data

              area       pop  pop_density
California  423967  38332521    90.413926
Texas       695662  26448193    38.018740
New York    141297  19651127   139.076746
Florida     170312  19552860   114.806121
Illinois    149995  12882135    85.883763

In [52]:
data.columns

Index(['area', 'pop', 'pop_density'], dtype='object')

In [53]:
data["pop_density"]

California     90.413926
Texas          38.018740
New York      139.076746
Florida       114.806121
Illinois       85.883763
Name: pop_density, dtype: float64

As mentioned previously, we can also view the DataFrame as an enhanced two-dimensional array. We can examine the raw underlying data array using the values attribute:

In [54]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

With this picture in mind, many familiar array-like observations can be done on the DataFrame itself. For example, we can transpose the full DataFrame to swap rows and columns:

In [55]:
data.T

,California,Texas,New York,Florida,Illinois
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
pop,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
pop_density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

When it comes to indexing of DataFrame objects, however, it is clear that the dictionary-style indexing of columns precludes our ability to simply treat it as a NumPy array. In particular, passing a single index to an array accesses a row:

In [56]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

and passing a single "index" to a DataFrame accesses a column:

In [57]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Thus for array-style indexing, we need another convention. Here Pandas again uses the `.loc` and `.iloc` indexers mentioned earlier. Using the `.iloc` indexer, we can index the underlying array as if it is a simple NumPy array (using the implicit Python-style index), but the DataFrame index and column labels are maintained in the result:

In [58]:
data

              area       pop  pop_density
California  423967  38332521    90.413926
Texas       695662  26448193    38.018740
New York    141297  19651127   139.076746
Florida     170312  19552860   114.806121
Illinois    149995  12882135    85.883763

In [59]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

Similarly, using the `.loc` indexer we can index the underlying data in an array-like style but using the explicit index and column names:

In [60]:
data.loc[:'New York', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

We can also pass conditions to the indexer, a technique called **masking**.

In [61]:
# masking with .loc

data.loc[data.pop_density > 100]

            area       pop  pop_density
New York  141297  19651127   139.076746
Florida   170312  19552860   114.806121

In [62]:
# masking with explicit column index

data[(data["pop_density"] > 50) & (data["area"] > 150000)]

              area       pop  pop_density
California  423967  38332521    90.413926
Florida     170312  19552860   114.806121

### **Exercise**: Produce a DF of states with population >15M and <30M. Name this DF `mid_sized_states_df`.

In [63]:
data

              area       pop  pop_density
California  423967  38332521    90.413926
Texas       695662  26448193    38.018740
New York    141297  19651127   139.076746
Florida     170312  19552860   114.806121
Illinois    149995  12882135    85.883763

In [64]:
# Your code here


mid_sized_states_df = data[(data["pop"] > 15000000) & (data["pop"] < 30000000)]

In [65]:
mid_sized_states_df

            area       pop  pop_density
Texas     695662  26448193    38.018740
New York  141297  19651127   139.076746
Florida   170312  19552860   114.806121

Any of these indexing conventions may also be used to set or modify values; this is done in the standard way that you might be accustomed to from working with NumPy:

In [66]:
data.loc["California","pop_density"] = 100
data

              area       pop  pop_density
California  423967  38332521   100.000000
Texas       695662  26448193    38.018740
New York    141297  19651127   139.076746
Florida     170312  19552860   114.806121
Illinois    149995  12882135    85.883763

### **Excercise**: Set the population of New York to 20M

In [67]:
# Your code here

data.loc["New York","pop"] = 20000000

In [68]:
data

              area       pop  pop_density
California  423967  38332521   100.000000
Texas       695662  26448193    38.018740
New York    141297  20000000   139.076746
Florida     170312  19552860   114.806121
Illinois    149995  12882135    85.883763

In [69]:
mid_sized_states_df["area_x10"] = mid_sized_states_df["area"]*10

/var/folders/g1/hrpxkq195m90bvz4qpv38w380000gn/T/ipykernel_10455/4108304400.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mid_sized_states_df["area_x10"] = mid_sized_states_df["area"]*10

The above error is something you will encounter when working with pandas Dataframes. It is intended to give you a warning that the behavior that you will get executing this code is not always what you expect. It comes from the definition of mid_sized_states_df.

Pandas is unsure whether you wanted to add values to the 'data' dataframe or the 'mid_sized_states_df' dataframe!
To get rid of this error, you can explicitly copy the dataframe so pandas knows we are trying to add a column to the 'new' dataframe 'mid_sized_states_df'.

In [70]:
mid_sized_states_df = data[(data["pop"] > 15000000) & (data["pop"] < 30000000)].copy()
mid_sized_states_df["area_x10"] = mid_sized_states_df["area"]*10

In [71]:
mid_sized_states_df

            area       pop  pop_density  area_x10
Texas     695662  26448193    38.018740   6956620
New York  141297  20000000   139.076746   1412970
Florida   170312  19552860   114.806121   1703120

### Data anaylsis and manipulation in `Pandas`

#### Hierarchical Indexing

**Using MultiIndex to create hierarchichal DataFrames**

Often it is useful to store higher-dimensional data, i.e. data indexed by more than one or two keys. The most approapriate Pandas function for this is `MultiIndex`. We will demonstrate using a simple example:

In [72]:
# We use 2-D example, first specifying the outer and inner dimension as well as the values
Outer = ['California','California',
         'New York','New York',
         'Texas','Texas']

Inner = [2000,2010,
         2000,2010,
         2000,2010]

populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]

# From the outer and inner dimensions we create an index

index_list = list(zip(Outer,Inner))
index_list

[('California', 2000),
 ('California', 2010),
 ('New York', 2000),
 ('New York', 2010),
 ('Texas', 2000),
 ('Texas', 2010)]

In [73]:
# From this index a multi index can be created
index_object = pd.MultiIndex.from_tuples(index_list)
index_object

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [74]:
# Finally we create a data frame with hierarchichal indexes

df = pd.DataFrame(index=index_object,
                  data=populations,
                  columns=["Population"])

df

                 Population
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [75]:
area = [164,164, #California 
        55,55,   #NY State
        269,269] #Texas

df["Area"] = area
df["Density"] = df["Population"]/df["Area"]
df

                 Population  Area        Density
California 2000    33871648   164  206534.439024
           2010    37253956   164  227158.268293
New York   2000    18976457    55  345026.490909
           2010    19378102    55  352329.127273
Texas      2000    20851820   269   77516.059480
           2010    25145561   269   93477.921933

In [76]:
# We can traspose this DataFrame
df.transpose()

              California                    New York                \
                    2000          2010          2000          2010
Population  3.387165e+07  3.725396e+07  1.897646e+07  1.937810e+07
Area        1.640000e+02  1.640000e+02  5.500000e+01  5.500000e+01
Density     2.065344e+05  2.271583e+05  3.450265e+05  3.523291e+05

                   Texas
                    2000          2010
Population  2.085182e+07  2.514556e+07
Area        2.690000e+02  2.690000e+02
Density     7.751606e+04  9.347792e+04

**MultiIndex as extra dimension**

You might notice that we could have stored the same data using a simple DataFrame with index and column labels. The `unstack()` method let's us convert a hierachically indexed Series into a conventionally indexed DataFrame

In [77]:
df.unstack()["Area"]

            2000  2010
California   164   164
New York      55    55
Texas        269   269

#### Quick data analysis in `Pandas`

In practice your dataset will often be considerably larger than the illustrative example above. In these cases it is often useful to run brief descriptive statistical analyses on the set, which will help to get a first feel for the data. 

We will demonstrate how to do this using the provided `iris.csv` dataset. This is a famous dataset used frequently for educational purposes in data science. You can read up on the dataset, its content and its origins here: https://en.wikipedia.org/wiki/Iris_flower_data_set.

The iris dataset contains measurements for 150 iris flowers from three different species.

The __three classes__ in the Iris dataset:
* Iris-setosa (n=50)
* Iris-versicolor (n=50)
* Iris-virginica (n=50)

The __four features__ of the Iris dataset:
* sepal length in cm
* sepal width in cm
* petal length in cm
* petal width in cm

![Iris dataset explained (Source: apsl.net)](iris.original.png)

In [78]:
# first read in the data as a dataset
# for the indirect reference "iris.csv" to work make sure it is contained in the same folder as your notebook
# You can set the index by using the index_col function
file_path="/Users/philipppeter/Repo/DSML_2022/03_Workshops/DSML_WS_03_Pandas/"
Iris_set = pd.read_csv(f"{file_path}iris.csv", sep=",", index_col="number")

In [79]:
Iris_set.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [80]:
Iris_set.head(10)

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
number
1                5.1          3.5           1.4          0.2  setosa
2                4.9          3.0           1.4          0.2  setosa
3                4.7          3.2           1.3          0.2  setosa
4                4.6          3.1           1.5          0.2  setosa
5                5.0          3.6           1.4          0.2  setosa
6                5.4          3.9           1.7          0.4  setosa
7                4.6          3.4           1.4          0.3  setosa
8                5.0          3.4           1.5          0.2  setosa
9                4.4          2.9           1.4          0.2  setosa
10               4.9          3.1           1.5          0.1  setosa

In [81]:
# the describe function provides an overviewof key descriptive statistics
Iris_set.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    148.000000   149.000000    149.000000   150.000000
mean       5.827703     3.055705      3.753020     1.199333
std        0.818479     0.436878      1.770195     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.300000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [82]:
Iris_set.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  148 non-null    float64
 1   Sepal.Width   149 non-null    float64
 2   Petal.Length  149 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [83]:
# you can also focus your analysis on individual features by indexing them

Iris_set["Sepal.Width"].describe()

count    149.000000
mean       3.055705
std        0.436878
min        2.000000
25%        2.800000
50%        3.000000
75%        3.300000
max        4.400000
Name: Sepal.Width, dtype: float64

In [84]:
# additionally you can call the functions seperately, e.g. max

Iris_set.count()

Sepal.Length    148
Sepal.Width     149
Petal.Length    149
Petal.Width     150
Species         150
dtype: int64

#### Handling missing numerical data (`NaN` values)
If you have paid attention to the descriptive statistics above you will have noticed that some the __count__ of values differs across features. This is a first indication for missing numerical data. In the real world you will often encounter incomplete and noisy data which will require pre-processing before you can apply data science and machine learning tools to them. In this section we will provide a quick overview on how to deal with missing data in your data sets. 
Note that Python has two ways of highlighting missing data:
* `NaN` - (acronym for Not a Number), is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation
* `None` - Python-specific object that is often used for missing data in Python code. Because it is a Python object, `Non` can only be used in arrays with data type 'object' (i.e., arrays of Python objects)

**Detecting missing numerical data**

Pandas data structures have two useful methods for detecting null data: `isnull()` and `notnull()`. Either one will return a Boolean mask over the data.

In [85]:
# isnull() returns "True" for every missing numerical value in the dataset
Iris_set.isnull()

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
number
1              False        False         False        False    False
2              False        False         False        False    False
3              False        False         False        False    False
4              False        False         False        False    False
5              False        False         False        False    False
...              ...          ...           ...          ...      ...
146            False        False         False        False    False
147            False        False         False        False    False
148            False        False         False        False    False
149            False        False         False        False    False
150            False        False         False        False    False

[150 rows x 5 columns]

In [86]:
# notnull() returns "False" for every missing numerical value in the dataset

Iris_set.notnull()

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
number
1               True         True          True         True     True
2               True         True          True         True     True
3               True         True          True         True     True
4               True         True          True         True     True
5               True         True          True         True     True
...              ...          ...           ...          ...      ...
146             True         True          True         True     True
147             True         True          True         True     True
148             True         True          True         True     True
149             True         True          True         True     True
150             True         True          True         True     True

[150 rows x 5 columns]

#### Dealing with missing numerical data
In essence two approaches to dealing with missing data exist:
* __Elimination__: Dropping null values from the dataset
* __Imputation__: Imputing/replacing null values with numerical values/estimates

**Elimination (i.e. dropping null values)**

We cannot drop single values from a data frame; we can only drop full rows or full columns. Depending on the application, you might want one or the other, so `dropna()` gives a number of options:

We use the `dropna(axis=0)` function to drop all rows from the dataset that incl. null values. Note that `dropna()` will not modify your dataframe unless you call `dropna(axis=0,inplace=True)`

In [87]:
Iris_set.dropna(axis=0, inplace=False)

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
number
1                5.1          3.5           1.4          0.2     setosa
2                4.9          3.0           1.4          0.2     setosa
3                4.7          3.2           1.3          0.2     setosa
4                4.6          3.1           1.5          0.2     setosa
5                5.0          3.6           1.4          0.2     setosa
...              ...          ...           ...          ...        ...
146              6.7          3.0           5.2          2.3  virginica
147              6.3          2.5           5.0          1.9  virginica
148              6.5          3.0           5.2          2.0  virginica
149              6.2          3.4           5.4          2.3  virginica
150              5.9          3.0           5.1          1.8  virginica

[146 rows x 5 columns]

We use the `dropna(axis=1)` function to drop all columns from the dataset that incl. null values. Note that, also in this case, `dropna()` will not modify your dataframe unless you call `dropna(axis=1,inplac=True)`

In [88]:
Iris_set.dropna(axis=1)

        Petal.Width    Species
number
1               0.2     setosa
2               0.2     setosa
3               0.2     setosa
4               0.2     setosa
5               0.2     setosa
...             ...        ...
146             2.3  virginica
147             1.9  virginica
148             2.0  virginica
149             2.3  virginica
150             1.8  virginica

[150 rows x 2 columns]

In [89]:
#Iris_set

In [90]:
# As can be seen below dropna() does not modify the original dataframe!

len(Iris_set)

150

In [91]:
# We can therefore also use dropna() to easily identify the number of rows with missing values 

len(Iris_set)-len(Iris_set.dropna())

4

In [92]:
# If you whish to clean the data with dropna it is good practice to define a new data frame

Iris_set_clean = Iris_set.dropna(axis=0)

In [93]:
len(Iris_set_clean)

146

In [94]:
#Iris_set.dropna(axis=0,inplace=True)
len(Iris_set)

150

### **Exercise**: Use the technique of **masking** to display all records with NaN values for Sepal.Length.

In [95]:
# Your code here


Iris_set[Iris_set["Sepal.Width"].isnull()==True]

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
number
24               5.1          NaN           1.7          0.5  setosa

**Imputation (i.e. filling null values)**

Imputation fills null values with numerical values chosen by the data scientist. For this `fillna()`provides the appropriate tools.

The data scientist will usually choose one of the following methods:
* Fill with zeros: `fillna(0)`
* Conduct a forward fill (i.e. filling NaN values with data from following observation): `fillna(method="ffill")`
* Conduct a backward fill (i.e. filling NaN values with data from previous observation): `fillna(method="bfill")`
* Fill with the column mean,max,min, etc.: `df["Col_name"].fillna(value=df["Col_name"].mean())`
* Custom fill depending on the application

In [96]:
# fillna() allows for inserting a number of choice, confirm with inplace=True

Iris_set[["Sepal.Length"]].fillna(value=Iris_set["Sepal.Length"].mean())

        Sepal.Length
number
1                5.1
2                4.9
3                4.7
4                4.6
5                5.0
...              ...
146              6.7
147              6.3
148              6.5
149              6.2
150              5.9

[150 rows x 1 columns]

#### Data aggregation and grouping
The `groupby()` method allows for grouping of rows and the application of aggregation functions to these grouped rows. It is a highly useful method in data science and unsed extensively. We will return to the iris dataset for illustration purposes.

In [97]:
# We might want to group rows according to "Species" and assign to a new variable "Species_group"
# This now allows us to perform a whole range of aggregation methods on the groups, e.g. take mean of all features:

Species_groups_mean = Iris_set.groupby("Species").mean()

In [98]:
Species_groups_mean

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa          5.006000     3.430612      1.462000        0.246
versicolor      5.936000     2.770000      4.255102        1.326
virginica       6.570833     2.974000      5.552000        2.026

In [99]:
# you can also use other aggregation routines, incl. .sum(), max(), min(), count() and others

Species_groups_min = Iris_set.groupby("Species").min()

In [100]:
Species_groups_min

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [101]:
#### Try some aggreagtion routines on the sample here:

Finally you can also profide custom aggreagtion routines, which is useful if features follow different aggregation routines. As an illustrative (albeit not very realistic example) we will implement the following aggregation rules:

- Sepal.Length: `max()`
- Sepal.Width:`mean()`
- Petal.Length: `min()`
- Petal.Width: `mean()`

Custom aggregation is implemeted via the `.agg()`command.

In [102]:
# define a dictionary that maps features to aggreagation routines

agg_dict = {'Sepal.Length':"max", 'Sepal.Width':"mean", 'Petal.Length':"min", 'Petal.Width':"mean"}

In [103]:
Species_groups_custom = Iris_set.groupby("Species").agg(agg_dict)

In [104]:
Species_groups_custom

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa               5.8     3.430612           1.0        0.246
versicolor           7.0     2.770000           3.0        1.326
virginica            7.9     2.974000           4.5        2.026

This brings us to the end of `Workshop_03`. Next week we will cover visualization techniques using `Matplotlib`.

---